# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
first_serie = pd.Series(np.random.randint(1,4, 100), name='first_serie')
second_serie = pd.Series(np.random.randint(1,3, 100), name='second_serie')
third_serie = pd.Series(np.random.randint(10000,30000, 100), name='third_serie')

In [4]:
first_serie

0     1
1     3
2     1
3     3
4     1
     ..
95    3
96    1
97    2
98    1
99    2
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [13]:
new_df = pd.concat([first_serie, second_serie, third_serie], axis=1)

In [14]:
new_df

    first_serie  second_serie  third_serie
0             2             1        16918
1             2             1        20637
2             3             1        11661
3             2             2        19972
4             2             2        20704
..          ...           ...          ...
95            2             2        22969
96            2             2        27676
97            3             1        15819
98            2             2        26330
99            1             1        18118

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [21]:
new_df.rename(columns  = {"first_serie": "bedrs", "second_serie": "bathrs", "third_serie": "price_sqr_meter"}, inplace=True)

In [22]:
new_df

    bedrs  bathrs  price_sqr_meter
0       2       1            16918
1       2       1            20637
2       3       1            11661
3       2       2            19972
4       2       2            20704
..    ...     ...              ...
95      2       2            22969
96      2       2            27676
97      3       1            15819
98      2       2            26330
99      1       1            18118

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
bigcolumn = pd.concat([first_serie, second_serie, third_serie], axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       2
1       2
2       3
3       2
4       2
..    ...
95  22969
96  27676
97  15819
98  26330
99  18118

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299